# frozen_string_literal: true

tap 'caskroom/cask'
tap 'homebrew/cask-fonts'
tap 'caskroom/versions'
tap 'cloudfoundry/tap'
tap 'git-duet/tap'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'universal-ctags/universal-ctags'

brew 'aria2'
brew 'asdf'
brew 'automake'
brew 'autojump'
brew 'bash'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'bat'
brew 'bison'
brew 'cheat'
brew 'cscope'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'direnv'
brew 'docker'
brew 'emacs'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'gdbm'
brew 'ghi'
brew 'git'
brew 'git-duet/tap/git-duet'
brew 'glances'
brew 'gnupg'
brew 'graphviz'
brew 'htop'
brew 'httpie'
brew 'kitty'
brew 'jq'
brew 'keychain'
brew 'lastpass-cli'
brew 'libffi'
brew 'libyaml'
brew 'markdown'
brew 'neovim'
brew 'npm'
brew 'openssl'
brew 'pinentry-mac'
brew 'postgresql@11', restart_service: true
brew 'pcre' # secretly required for wget
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'shellcheck'
brew 'sqlite3'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'

cask 'atom'
cask 'caskroom/versions/iterm2-nightly'
cask 'firefox'
cask 'flycut'
cask 'google-chrome'
cask 'homebrew/cask-fonts/font-aurulentsansmono-nerd-font'
cask 'homebrew/cask-fonts/font-firacode-nerd-font'
cask 'homebrew/cask-fonts/font-furacode-nerd-font'
cask 'homebrew/cask-fonts/font-hack-nerd-font'
cask 'homebrew/cask-fonts/font-hasklug-nerd-font'
cask 'homebrew/cask-fonts/font-inconsolata-nerd-font'
cask 'homebrew/cask-fonts/font-jetbrainsmono-nerd-font'
cask 'insomnia'
cask 'java'
cask 'spectacle'
cask 'virtualbox'
cask 'vlc'
cask 'zoomus'
